---
kind: other
id: Properties.T:Autodesk.Revit.UI.ColorSelectionDialog
source: html/bbc5c298-ba0e-9f6e-349c-4c1a31927955.htm
---
# ColorSelectionDialog Properties

Specifies whether the .NET object represents a valid Revit entity.